{
  "details": [
    {
      "id": 1,
      "title": "sinners",
      "poster": "img/sinners.png",
      "year": "2025",
      "genre": "horror",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Sinners is a Southern Gothic horror-musical directed by Ryan Coogler. Set in 1930s Mississippi, it follows twin brothers who open a juke joint that becomes a battleground between a Black community and a group of supernatural vampires. Blending music, horror, and social commentary, the film explores themes of race, identity, and cultural power through a haunting and visually rich story.​",
      "our-review": "Sinners has captured the attention of viewers with its dark, gripping storyline that explores moral ambiguity and the complexity of human desires. The show's intricate character development, particularly in its portrayal of conflicted protagonists, has been widely praised for its depth and realism. The suspenseful narrative keeps audiences on edge, with unexpected twists that heighten the emotional stakes. However, some viewers have noted that while the show's atmosphere is compelling, certain plot points can feel overly convoluted. Overall, Sinners offers a captivating blend of psychological drama and thriller elements, making it a strong choice for fans of intense, thought-provoking television.",
      "cast": "Michael B. Jordan as Elijah Smoke Moore / Elias Stack, Moore Miles Caton as Sammie Moore, Jack O'Connell as Remmick, Hailee Steinfeld as Mary, Wunmi Mosaku as Annie Delroy Lindo as Delta Slim",
      "first-name": "Alex Harper",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Sinners is a unique mix of horror and musical, set in 1930s Mississippi. The film's eerie atmosphere, combined with a blues-heavy soundtrack, creates a haunting experience. Michael B. Jordan shines in his dual role, and Miles Caton’s performance is a standout. While the plot can be a bit confusing, the film’s bold commentary on race and identity, along with its supernatural twists, makes it a memorable watch.",
      "second-name": "Hailey Smith",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Sinners offers an interesting mix of horror and musical elements, set against a Southern Gothic backdrop. The atmosphere is captivating, and the music adds depth to the story. Michael B. Jordan does a solid job, but the plot feels a bit overcomplicated at times. While it explores important themes of race and identity, it doesn’t fully deliver on its potential. Still, it’s a unique film worth watching if you’re into bold, genre-bending stories."
    },
    {
      "id": 2,
      "title": "Spider-Man: No Way Home",
      "poster": "img/spiderman-noway-home.png",
      "year": "2021",
      "genre": "action, superhero",
      "rating": "⭐️⭐️⭐️⭐️½",
      "summary": "Spider-Man: No Way Home, directed by Jon Watts, brings together three generations of Spider-Men in a multiverse-shattering event. After Peter Parker’s identity is exposed, he turns to Doctor Strange for help, unleashing chaos as villains from other realities arrive in his world. A thrilling, emotional ride blending nostalgia, action, and sacrifice.",
      "our-review": "No Way Home is both a celebration of Spider-Man’s cinematic legacy and a heartfelt story about identity and consequence. Tom Holland delivers his most mature performance, while the returning villains and Spider-Men make for unforgettable fan moments. Though the plot can feel packed, the emotional payoff is immense.",
      "cast": "Tom Holland as Peter Parker, Zendaya as MJ, Benedict Cumberbatch as Doctor Strange, Willem Dafoe as Green Goblin, Tobey Maguire as Peter Parker (Earth-96283), Andrew Garfield as Peter Parker (Earth-120703)",
      "first-name": "Caleb Norris",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "Absolutely incredible! Seeing Tobey, Andrew, and Tom together brought tears to my eyes. The emotional beats hit hard, and the action was top-tier.",
      "second-name": "Emily Zhao",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "The nostalgia is powerful, and it’s one of the most ambitious superhero films yet. Some plot holes, but who cares when it’s this much fun?"
    },
    {
      "id": 3,
      "title": "Dune: Part Two",
      "poster": "img/dune.png",
      "year": "2024",
      "genre": "sci-fi, adventure",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "Directed by Denis Villeneuve, Dune: Part Two continues Paul Atreides' journey as he unites with the Fremen to seek vengeance and fulfill his destiny on the desert planet Arrakis. With war looming, alliances are forged, and a messianic prophecy begins to unfold.",
      "our-review": "Epic in scope and stunning in execution, Dune: Part Two is a masterclass in world-building and storytelling. Timothée Chalamet delivers a commanding performance, while the film's visuals and score are utterly mesmerizing. A cinematic triumph that honors the source material while pushing sci-fi boundaries.",
      "cast": "Timothée Chalamet as Paul Atreides, Zendaya as Chani, Rebecca Ferguson, Josh Brolin, Javier Bardem, Florence Pugh, Austin Butler",
      "first-name": "Kevin Tran",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "Absolutely mind-blowing. Denis Villeneuve has created something timeless. The visuals, the themes, the tension—it’s all perfectly balanced.",
      "second-name": "Sofia Moreno",
      "second-rating": "⭐️⭐️⭐️⭐️½",
      "second-review": "More action-packed than the first and emotionally richer. A bit long, but well worth it for sci-fi fans."
    },
    {
      "id": 4,
      "title": "Barbie",
      "poster": "img/barbie.png",
      "year": "2023",
      "genre": "comedy, fantasy",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Directed by Greta Gerwig, Barbie is a satirical yet heartfelt take on identity and womanhood. When Barbie leaves her perfect pink world to explore the real one, she confronts societal norms and rediscovers what it truly means to be herself.",
      "our-review": "Barbie is unexpectedly clever, layered with witty humor and emotional insight. Margot Robbie and Ryan Gosling shine in a story that balances fun and feminism without losing its charm. A colorful, bold cinematic statement.",
      "cast": "Margot Robbie as Barbie, Ryan Gosling as Ken, America Ferrera, Kate McKinnon, Simu Liu, Will Ferrell",
      "first-name": "Jenna Price",
      "first-rating": "⭐️⭐️⭐️⭐️½",
      "first-review": "Greta Gerwig made Barbie funny, thoughtful, and empowering. Totally not what I expected—in a good way.",
      "second-name": "Elliot Hughes",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "Bright and hilarious. Some jokes are a little on the nose, but it’s refreshing to see something so unapologetically different."
    },
    {
      "id": 5,
      "title": "Oppenheimer",
      "poster": "img/oppenheimer.png",
      "year": "2023",
      "genre": "drama, historical, thriller",
      "rating": "⭐️⭐️⭐️⭐️½",
      "summary": "Christopher Nolan’s Oppenheimer is a biographical thriller chronicling the life of J. Robert Oppenheimer and the development of the atomic bomb. Intense, cerebral, and gripping, it’s a film about genius, guilt, and legacy.",
      "our-review": "Cillian Murphy delivers a haunting performance in a film that’s as intellectually dense as it is emotionally raw. Nolan’s non-linear storytelling works well here, though it may challenge some viewers. A thought-provoking epic.",
      "cast": "Cillian Murphy as J. Robert Oppenheimer, Emily Blunt, Robert Downey Jr., Matt Damon, Florence Pugh, Rami Malek",
      "first-name": "Luis Chang",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Heavy and intense. Not your typical Nolan action film, but one of his most mature and important works.",
      "second-name": "Naomi Sinclair",
      "second-rating": "⭐️⭐️⭐️⭐️½",
      "second-review": "Cillian Murphy is phenomenal. The weight of history just crushes you in the best way. Demands your full attention."
    },
    {
      "id": 6,
      "title": "Avatar: The Way of Water",
      "poster": "img/avatar-2.png",
      "year": "2022",
      "genre": "sci-fi, adventure",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "James Cameron returns with a breathtaking sequel that explores the oceanic world of Pandora. As Jake Sully and Neytiri face new threats, they must protect their family and embrace the rhythms of the sea.",
      "our-review": "Visually stunning and emotionally rich, The Way of Water expands Avatar’s universe with awe-inspiring underwater sequences. While the plot isn’t groundbreaking, the immersive world-building and heartfelt themes more than compensate.",
      "cast": "Sam Worthington, Zoe Saldaña, Sigourney Weaver, Kate Winslet, Stephen Lang",
      "first-name": "Amir Wallace",
      "first-rating": "⭐️⭐️⭐️⭐️½",
      "first-review": "One of the most beautiful films I’ve ever seen. The story is simple but powerful. Cameron still has it.",
      "second-name": "Rachel Lim",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "It’s long but magical. The underwater visuals are breathtaking. I felt like I was on Pandora."
    },
    {
      "id": 7,
      "title": "John Wick: Chapter 4",
      "poster": "img/john-wick-4.png",
      "year": "2023",
      "genre": "action, thriller",
      "rating": "⭐️⭐️⭐️⭐️½",
      "summary": "In Chapter 4, John Wick faces his most dangerous foes yet as he seeks freedom from the High Table. With alliances shifting and battles raging across continents, the stakes have never been higher.",
      "our-review": "Stylish, relentless, and beautifully choreographed, John Wick 4 pushes action cinema to its limits. Keanu Reeves is as stoic and badass as ever, and the film’s global scale keeps it fresh without losing its core intensity.",
      "cast": "Keanu Reeves, Donnie Yen, Hiroyuki Sanada, Bill Skarsgård, Laurence Fishburne",
      "first-name": "Tyler Brooks",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "The fight scenes are insane. Best action movie I’ve seen in years. Keanu just doesn’t miss.",
      "second-name": "Lana Ortiz",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A wild ride from start to finish. Some parts feel repetitive, but the spectacle is unmatched."
    },
    {
      "id": 8,
      "title": "The Batman",
      "poster": "img/the-batman.png",
      "year": "2022",
      "genre": "crime, superhero, noir",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Directed by Matt Reeves, The Batman reimagines the caped crusader in a gritty detective noir. Battling corruption and facing the enigmatic Riddler, Bruce Wayne delves deeper into Gotham’s shadows than ever before.",
      "our-review": "Dark, atmospheric, and cerebral, The Batman is a gripping take on the world’s greatest detective. Robert Pattinson brings a brooding intensity, and the film’s tone feels closer to a mystery thriller than traditional superhero fare.",
      "cast": "Robert Pattinson as Bruce Wayne, Zoë Kravitz as Selina Kyle, Paul Dano as The Riddler, Jeffrey Wright, Colin Farrell",
      "first-name": "Marcus Dean",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Moody and immersive. Feels like a crime novel brought to life. Pattinson really surprised me.",
      "second-name": "Elena Rivera",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "Loved the noir vibe and mystery. Some pacing issues, but visually and tonally fantastic."
    },
    {
      "id": 9,
      "title": "Everything Everywhere All At Once",
      "poster": "img/eeaao.png",
      "year": "2022",
      "genre": "sci-fi, drama, comedy",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "Directed by the Daniels, this genre-bending film follows Evelyn, a laundromat owner who is pulled into a multiverse adventure where she must tap into alternate lives to save existence—and her family.",
      "our-review": "Inventive, chaotic, and deeply human, this film is a rare blend of absurdity and emotion. Michelle Yeoh gives a career-best performance, and the movie’s wild creativity is balanced by poignant themes of love and acceptance.",
      "cast": "Michelle Yeoh, Ke Huy Quan, Stephanie Hsu, Jamie Lee Curtis, James Hong",
      "first-name": "Riley Chen",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "Mind-blowing and touching. I laughed, cried, and sat in awe. Easily one of the best movies I’ve ever seen.",
      "second-name": "Darius King",
      "second-rating": "⭐️⭐️⭐️⭐️½",
      "second-review": "Completely unique. So much packed into one movie, but it works. Weird in the best way possible."
    },
    {
      "id": 10,
      "title": "Materialists",
      "poster": "materialists.jpeg",
      "year": "2024",
      "genre": "romance, drama",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Materialists follows two passionate individuals caught in the whirlwind of love, ambition, and the search for identity. Set in the bustling world of high-end fashion, they must navigate their personal desires while facing the pressures of a materialistic society.",
      "our-review": "With its stylish cinematography and compelling performances, Materialists is an engaging exploration of love in a consumer-driven world. The chemistry between the leads is palpable, and the film offers a sharp critique of materialism, though its pace might slow down during some introspective moments.",
      "cast": "Emma Stone, Tom Holland, Lily Collins, Henry Golding",
      "first-name": "Mia Walker",
      "first-rating": "⭐️⭐️⭐️⭐️½",
      "first-review": "A beautifully shot film with excellent performances. The love story is heartfelt and the themes of materialism hit home. Highly recommended for fans of romantic dramas with a social twist.",
      "second-name": "Oliver Bates",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "An enjoyable film that tackles real issues about modern love and materialism. The lead actors are excellent, and the cinematography is stunning. However, the plot could have been more original."
    },
    {
      "id": 11,
      "title": "Another Simple Favor",
      "poster": "another-simple-favor.jpeg",
      "year": "2023",
      "genre": "romance, mystery, thriller",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "In this mystery-thriller, a woman tries to uncover the truth behind her best friend's sudden disappearance. As she delves deeper, she uncovers secrets that challenge everything she thought she knew about love and friendship.",
      "our-review": "Another Simple Favor offers a thrilling blend of romance and mystery, keeping the audience guessing with every twist. The lead performances are strong, though the movie occasionally teeters on the edge of melodrama. It's a fun ride with a few unexpected surprises.",
      "cast": "Blake Lively, Anna Kendrick, Henry Golding, Dan Stevens",
      "first-name": "Sarah Blake",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "The chemistry between Blake Lively and Anna Kendrick is fantastic. A great mix of suspense and romance. Some of the plot twists felt a bit forced, but the film keeps you on the edge of your seat.",
      "second-name": "Lucas Ford",
      "second-rating": "⭐️⭐️⭐️⭐️½",
      "second-review": "A thrilling and entertaining film. The suspense kept me hooked, and the chemistry between the leads was fantastic. I would have loved a bit more depth in the secondary characters, but overall, a solid movie."
    },
    {
      "id": 12,
      "title": "On Swift Horses",
      "poster": "on-swift-horses.jpeg",
      "year": "2025",
      "genre": "romance, western",
      "rating": "⭐️⭐️⭐️⭐️½",
      "summary": "Set in the rugged American West, On Swift Horses is a sweeping tale of love, loss, and redemption. Two lovers ride across the vast landscape, with both their pasts and the law chasing after them.",
      "our-review": "On Swift Horses blends breathtaking landscapes with a poignant love story. The film expertly captures the spirit of the Old West, with standout performances from the lead actors. The pacing is steady, though some moments may feel drawn out.",
      "cast": "Chris Hemsworth, Alicia Vikander, Tom Hiddleston, Dakota Fanning",
      "first-name": "Jake Carter",
      "first-rating": "⭐️⭐️⭐️⭐️½",
      "first-review": "An excellent western romance that offers stunning visuals and emotional depth. The chemistry between Hemsworth and Vikander is undeniable, making this a memorable cinematic experience.",
      "second-name": "Emily Morgan",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A beautifully shot film with a compelling love story at its heart. The performances were great, and while the story had its slow moments, the overall experience was satisfying."
    },
    {
      "id": 13,
      "title": "Heartstopper",
      "poster": "heartstopper-movie.jpeg",
      "year": "2024",
      "genre": "romance, drama, coming-of-age",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "Heartstopper follows two high school boys who embark on a tender journey of self-discovery and love. Their relationship unfolds amidst the challenges of school life, friendship, and identity.",
      "our-review": "Heartstopper is a charming, heartwarming film that touches on important themes of love and identity. The performances by the young cast are heartfelt, and the movie beautifully handles the delicate nature of LGBTQ+ relationships.",
      "cast": "Joe Locke, Kit Connor, Olivia Colman, Yasmin Finney",
      "first-name": "Maya Green",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "A perfect film for anyone who loves a sweet coming-of-age story. Heartstopper offers a genuine portrayal of love and friendship, and the chemistry between the leads is adorable. Highly recommended!",
      "second-name": "Daniel Hayes",
      "second-rating": "⭐️⭐️⭐️⭐️½",
      "second-review": "A beautiful adaptation of the beloved graphic novel. The film captures the magic of young love and the struggles that come with it. Some parts of the story are predictable, but the charm of the leads makes it worth watching."
    },
    {
      "id": 14,
      "title": "Ex Ex Lovers",
      "poster": "ex-ex-lovers.jpeg",
      "year": "2024",
      "genre": "romance, comedy",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "When two exes are forced to reconnect for a wedding, old feelings resurface. As they navigate the awkwardness of their past and present, they must decide whether to rekindle their romance or leave things in the past.",
      "our-review": "Ex Ex Lovers delivers a fresh twist on the rom-com genre. The leads have fantastic chemistry, and while the premise is familiar, the witty dialogue and humor make it enjoyable. The plot doesn't break new ground but is fun to watch.",
      "cast": "Sophie Turner, Nicholas Hoult, Emma Mackey, Henry Cavill",
      "first-name": "Chloe Evans",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A fun and heartwarming film that plays with the classic romantic tropes in a clever way. The leads are delightful, and the humor will keep you smiling throughout.",
      "second-name": "James Foster",
      "second-rating": "⭐️⭐️⭐️⭐️½",
      "second-review": "A solid rom-com with a bit of depth. The chemistry between Turner and Hoult is fantastic, and the humor feels genuine. A perfect movie for a light, fun evening."
    },
    {
      "id": 15,
      "title": "Sosyal Climbers",
      "poster": "sosyal-climbers.webp",
      "year": "2023",
      "genre": "romance, drama",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Sosyal Climbers is a heartfelt story about social climbing, personal growth, and the price of success. It follows two characters from different walks of life who find love while navigating the challenges of ambition and the pursuit of wealth.",
      "our-review": "Sosyal Climbers is an engaging and emotional story about love and ambition. The film excels in character development, and the performances bring the story to life. It's a bit slow at times, but the payoff is worth it.",
      "cast": "Selena Gomez, John Boyega, Florence Pugh, Tom Hiddleston",
      "first-name": "Lily Rose",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "An intriguing exploration of love and ambition. The performances are strong, and while the pacing is slow, the film makes up for it with its rich character arcs and emotional depth.",
      "second-name": "Liam Grant",
      "second-rating": "⭐️⭐️⭐️⭐️½",
      "second-review": "A powerful film that tackles deep themes with grace. The romance is beautifully portrayed, and the performances by the leads are exceptional."
    },
    {
      "id": 16,
      "title": "Wish You Were Here",
      "poster": "wish-you-were-here.jpeg",
      "year": "2023",
      "genre": "romance, drama",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Wish You Were Here is a poignant love story about two people from different worlds who meet during a life-changing trip abroad. They fall in love while grappling with personal demons and the emotional distance that keeps them apart.",
      "our-review": "A beautifully crafted love story that explores themes of distance, both physical and emotional. The film’s atmosphere is immersive, and the performances are emotionally charged, though the pacing can be slow at times.",
      "cast": "Timothée Chalamet, Florence Pugh, Zendaya, Isaac Hempstead-Wright",
      "first-name": "Isla Parker",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A deeply emotional journey with beautiful performances. The chemistry between Chalamet and Pugh is electric, and the story is poignant, though some moments drag.",
      "second-name": "Jasmine Lee",
      "second-rating": "⭐️⭐️⭐️⭐️½",
      "second-review": "A slow-burn romance with gorgeous cinematography. The film feels raw and emotional, making it a standout in the romance genre."
    },
    {
      "id": 17,
      "title": "Bridget Jones: Mad About The Boy",
      "poster": "bridget-jones-mad-about-the-boy.jpeg",
      "year": "2024",
      "genre": "romance, comedy",
      "rating": "⭐️⭐️⭐️⭐️½",
      "summary": "Bridget Jones returns, now navigating life as a single mother, struggling with love and dating in her 40s. Amidst the chaos of parenthood and career, she must come to terms with her feelings for a man who is both irresistible and unpredictable.",
      "our-review": "Bridget Jones: Mad About The Boy is a delightful and refreshing return to the beloved franchise. The humor is sharp, and the film balances comedy with emotional moments, thanks to an excellent performance by Renée Zellweger.",
      "cast": "Renée Zellweger, Colin Firth, Patrick Dempsey, Emma Thompson",
      "first-name": "Anna Roberts",
      "first-rating": "⭐️⭐️⭐️⭐️½",
      "first-review": "Bridget Jones is back, and she’s just as hilarious and charming as ever. The mix of comedy and romance is perfect, and the film stays true to the spirit of the original while offering something new.",
      "second-name": "Sophia Clark",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A great return to the Bridget Jones saga. The story feels fresh, and Zellweger is fantastic. The film has its funny moments, but also some touching ones that make it a must-watch for fans of the series."
    },
    {
      "id": 18,
      "title": "Winter Spring Summer or Fall",
      "poster": "winter-spring-summer-or-fall.jpeg",
      "year": "2024",
      "genre": "romance, drama",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Winter Spring Summer or Fall is a beautifully crafted love story that spans four seasons, exploring the evolution of a relationship through the passage of time. Each season represents a different phase in the couple's life, from the excitement of new love to the struggles of commitment.",
      "our-review": "This film is a poignant exploration of love, commitment, and the changing nature of relationships. With exceptional performances and stunning cinematography, the movie captures the emotional highs and lows of a romance that unfolds over the course of a year. The pacing is deliberate, but it’s a beautiful slow-burn that’s worth the wait.",
      "cast": "Dakota Johnson, Timothée Chalamet, Emma Stone, Lucas Hedges",
      "first-name": "Emily Rose",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A moving exploration of love that evolves with time. The performances are stellar, especially Chalamet and Johnson, but I found the pacing a bit slow at times. Nonetheless, it’s a beautifully crafted story about the growth of love.",
      "second-name": "Oliver Harris",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "The movie had a lot of promise, but I felt it dragged in parts. While the performances were solid, the slow pace and repetitive nature of the story made it harder to stay engaged throughout the film."
    },
    {
      "id": 19,
      "title": "Off the Record",
      "poster": "off-the-record.jpeg",
      "year": "2024",
      "genre": "romance, drama, mystery",
      "rating": "⭐️⭐️⭐️½",
      "summary": "Off the Record is a romantic thriller about a journalist who falls in love with a mysterious source while investigating a high-profile scandal. As their relationship deepens, the journalist uncovers secrets that blur the line between love and danger.",
      "our-review": "This film blends romance with mystery in a unique and captivating way. The tension between love and professional ethics is explored deeply, and the suspense keeps you engaged from start to finish. The chemistry between the leads adds an emotional layer to the thrilling narrative, though the ending might leave some viewers wanting more.",
      "cast": "Margot Robbie, Chris Hemsworth, Zazie Beetz, Jake Gyllenhaal",
      "first-name": "Grace Wilson",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A gripping and intriguing blend of romance and suspense. The chemistry between Robbie and Hemsworth is undeniable, and the plot offers several twists that keep you on edge. The ending was a bit too open-ended for my liking, but it’s still an exciting watch.",
      "second-name": "David Lee",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "While the concept was interesting, the pacing of the film felt off. The romance and suspense were good, but the characters could have been developed more. The plot had potential but didn't quite live up to it for me."
    },
    {
      "id": 20,
      "title": "Mission: Impossible – The Final Reckoning",
      "poster": "mission-impossible-the-final-reckoning.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "In the explosive final chapter of the Mission: Impossible series, Ethan Hunt faces his most dangerous mission yet, involving high-stakes espionage, lethal enemies, and personal sacrifice. The action sequences are intense, and the film delivers a breathtaking conclusion to an iconic franchise.",
      "our-review": "Mission: Impossible – The Final Reckoning delivers on every level. The action is non-stop, the stakes are higher than ever, and Tom Cruise gives his best performance yet. The final twist will leave audiences gasping for breath. A perfect closure to a legendary series.",
      "cast": "Tom Cruise as Ethan Hunt, Simon Pegg as Benji Dunn, Rebecca Ferguson as Ilsa Faust, Ving Rhames as Luther Stickell",
      "first-name": "James Stewart",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "This is the action-packed conclusion we've all been waiting for! The stunts, the choreography, and the plot twists are next level. A perfect action movie experience.",
      "second-name": "Sarah Lee",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A fantastic ride! While the plot is a bit predictable, the action sequences more than make up for it. Tom Cruise proves he's still got it."
    },
    {
      "id": 21,
      "title": "The Gorge",
      "poster": "the-gorge.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A thrilling tale of survival and vengeance, 'The Gorge' follows a team of elite soldiers who must navigate treacherous terrain and face deadly adversaries. A gripping mix of intense action and heart-pounding suspense.",
      "our-review": "While 'The Gorge' starts slow, it quickly escalates into an intense, heart-racing experience. The final showdown is exhilarating, and the film leaves a lasting impression.",
      "cast": "Michael Fassbender as Jack Hartley, Alicia Vikander as Sarah Devereux, Idris Elba as Marcus Ward",
      "first-name": "David Cruz",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A solid action movie with some truly breathtaking scenes. The pacing is tight, and the performances are stellar, especially Fassbender.",
      "second-name": "Lisa Brown",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "It’s a fun watch, but it felt like it could have been more. Still, the action sequences will keep you on the edge of your seat."
    },
    {
      "id": 22,
      "title": "Havoc",
      "poster": "havoc.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "'Havoc' delivers a relentless wave of violence and suspense, following a group of survivors as they fight to stay alive in a dystopian world. It's a brutal and unflinching look at human nature under pressure.",
      "our-review": "Packed with intensity, 'Havoc' is a raw and unforgiving action flick that keeps the audience invested in the survival of its characters. The fight choreography and world-building are the highlights.",
      "cast": "Chris Hemsworth as Ethan Hunt, Margot Robbie as Sophie Blake, Mahershala Ali as Marcus Harper",
      "first-name": "Kevin Smith",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Gripping from start to finish. Chris Hemsworth delivers another knockout performance in this gritty action film.",
      "second-name": "Katie Williams",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "A brutal and engaging film, but the pacing could have been tighter. Still, it's worth the watch for fans of intense action films."
    },
    {
      "id": 23,
      "title": "The Amateur",
      "poster": "the-amateur.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️",
      "summary": "A young and inexperienced fighter gets caught up in an underground fight club, where the stakes are life or death. As the fights escalate, he begins to question his choices and what he's willing to sacrifice.",
      "our-review": "'The Amateur' is a solid action film but doesn't quite live up to its full potential. The fight sequences are gritty, but the plot feels predictable. Nonetheless, it’s still a fun, adrenaline-pumping ride.",
      "cast": "Tom Holland as Alex Carter, Zendaya as Jessica Lee, Jason Statham as Viktor Kane",
      "first-name": "Johnathan Reed",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "An enjoyable action flick, but the story was too formulaic for me. Still, the fight scenes are well done, and Tom Holland brings a fresh energy to the role.",
      "second-name": "Rachel Green",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A lot of fun! Tom Holland is a great fit for the role, and the action scenes are brutal. The only downside is the predictability of the plot."
    },
    {
      "id": 24,
      "title": "Extraction 2",
      "poster": "extraction-2.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "Tyler Rake returns for a new mission in 'Extraction 2,' where he's tasked with rescuing the family of an influential crime lord. The action is even more intense than the first movie, with jaw-dropping stunts and explosive sequences.",
      "our-review": "An adrenaline rush from start to finish. 'Extraction 2' builds on everything that made the first film great, delivering bigger and better action, while maintaining the emotional stakes.",
      "cast": "Chris Hemsworth as Tyler Rake, Golshifteh Farahani as Nik, David Harbour as Gaspar",
      "first-name": "George Lawrence",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "This movie takes everything up a notch. The action is flawless, and Chris Hemsworth's performance is incredible.",
      "second-name": "Amanda Phelps",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A fantastic sequel that improves upon the original. The action scenes are some of the best I’ve ever seen, though the plot still feels a bit thin."
    },
    {
      "id": 25,
      "title": "Fast X",
      "poster": "fast-x.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️",
      "summary": "'Fast X' ramps up the speed and intensity, as Dom Toretto and his crew take on an international cartel. The high-speed chases, explosions, and stunts are on full display in this thrilling installment of the franchise.",
      "our-review": "A fun ride but lacking the heart and depth of earlier films in the franchise. The action is over-the-top, but it’s still entertaining for fans of the Fast & Furious series.",
      "cast": "Vin Diesel as Dominic Toretto, Michelle Rodriguez as Letty Ortiz, Jason Momoa as Dante Reyes",
      "first-name": "Liam Turner",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "Entertaining but predictable. If you're a fan of the franchise, you'll enjoy the action, but it lacks the emotional punch of earlier installments.",
      "second-name": "Sophie Carter",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "Big stunts, fast cars, and adrenaline-fueled action. 'Fast X' delivers the goods, even if the plot is a little thin."
    },
    {
      "id": 26,
      "title": "John Wick: Chapter 4",
      "poster": "john-wick-chapter-4.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "John Wick returns in this fourth chapter of the series, with even more relentless action, intense fight choreography, and an expansion of the mysterious assassin world. This one is the biggest and most brutal yet.",
      "our-review": "'John Wick: Chapter 4' is a masterpiece of action cinema. Keanu Reeves once again proves why he’s the king of fight scenes, and the world-building is expanded in exciting ways. The final fight will leave you breathless.",
      "cast": "Keanu Reeves as John Wick, Donnie Yen as Caine, Laurence Fishburne as The Bowery King",
      "first-name": "Ethan Black",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "This is peak action cinema. The choreography is mind-blowing, and Keanu Reeves delivers yet another iconic performance.",
      "second-name": "Olivia Moore",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "Keanu Reeves is at his best in this one. The action scenes are brutal, and the movie doesn't stop until the very end."
    },
    {
      "id": 27,
      "title": "Ant-Man and The Wasp: Quantumania",
      "poster": "ant-man-and-the-wasp-quantumania.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "'Ant-Man and The Wasp: Quantumania' continues the MCU's journey into the Quantum Realm, where Ant-Man and the Wasp must team up to stop a new threat that could change the multiverse forever.",
      "our-review": "The film combines humor, action, and heart, with Paul Rudd's charm at the forefront. It's a bit more serious than the previous Ant-Man films, but still a fun ride with incredible visual effects.",
      "cast": "Paul Rudd as Scott Lang, Evangeline Lilly as Hope Van Dyne, Michael Douglas as Hank Pym",
      "first-name": "Tommy Harris",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A fun addition to the MCU. While it's a bit overstuffed at times, the humor and heart shine through, making it an enjoyable experience.",
      "second-name": "Jessica Adams",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Great visuals and action, but the plot gets a bit messy. Still, it’s worth watching for Marvel fans."
    },
    {
      "id": 28,
      "title": "Guardians of the Galaxy Vol. 3",
      "poster": "guardians-of-the-galaxy-vol-3.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "The Guardians return for an emotional adventure in the final chapter of the trilogy. With epic battles and heartfelt moments, 'Guardians of the Galaxy Vol. 3' delivers an unforgettable conclusion to the saga.",
      "our-review": "'Guardians of the Galaxy Vol. 3' combines humor, emotion, and spectacular action to create one of the best films in the MCU. The characters' growth is touching, and the action scenes are as exhilarating as ever.",
      "cast": "Chris Pratt as Peter Quill, Zoe Saldana as Gamora, Dave Bautista as Drax",
      "first-name": "Brian Evans",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "A perfect ending to the trilogy. The action is spectacular, and the emotional beats hit hard. The best Guardians movie yet!",
      "second-name": "Megan Thompson",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A satisfying conclusion to the saga. The action is amazing, and the humor is on point, though some emotional moments felt a bit forced."
    },
    {
      "id": 29,
      "title": "Scream 6",
      "poster": "scream-6.jpeg",
      "year": "2025",
      "genre": "Action",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Ghostface returns with a vengeance in 'Scream 6', this time unleashing terror in the streets of New York City. With a more aggressive tone and higher stakes, the survivors of past killings must once again outsmart the masked killer.",
      "our-review": "'Scream 6' successfully reinvents the slasher formula with slick direction and brutal action sequences. While not a traditional action film, its intensity, pacing, and visceral violence elevate it into that category. It’s a refreshing entry for both horror and action fans.",
      "cast": "Melissa Barrera as Sam Carpenter, Jenna Ortega as Tara Carpenter, Courteney Cox as Gale Weathers",
      "first-name": "Noah Bennett",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Tense, gory, and surprisingly action-packed. The new setting adds freshness to the franchise, and the suspense never lets up.",
      "second-name": "Emily Tran",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Good kills and clever twists, though the plot does lose steam halfway through. Still, a solid entry in the series that leans heavier into action than expected."
    },
    {
      "id": 30,
      "title": "No Hard Feelings",
      "poster": "no-hard-feeling.jpeg",
      "year": "2023",
      "genre": "comedy, drama",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "No Hard Feelings follows a woman hired to date a shy 19-year-old in an attempt to help him come out of his shell, but along the way, she learns more about herself.",
      "our-review": "This film balances humor with heartfelt moments, offering a relatable coming-of-age story. Jennifer Lawrence delivers a stellar performance, bringing both depth and humor to her role.",
      "cast": "Jennifer Lawrence, Andrew Barth Feldman, Laura Benanti",
      "first-name": "Sophie Mills",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A hilarious and charming take on the coming-of-age genre. Jennifer Lawrence shines with her comedic timing, and the story resonates emotionally as well.",
      "second-name": "Mark Johnson",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "While it’s funny, I felt the pacing was a bit uneven at times. The chemistry between the leads is great, but the plot could have been more focused."
    },
    {
      "id": 31,
      "title": "Barbie",
      "poster": "barbie.jpeg",
      "year": "2023",
      "genre": "comedy, fantasy",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Barbie embarks on an adventure from Barbie Land to the real world, where she encounters unexpected challenges and learns that life is far from perfect.",
      "our-review": "A wonderfully absurd and self-aware comedy, 'Barbie' surprises with its humor, heart, and bold visual style. Margot Robbie and Ryan Gosling bring their characters to life with hilarious chemistry.",
      "cast": "Margot Robbie, Ryan Gosling, Will Ferrell",
      "first-name": "Emily Stone",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "An absolute joyride! It's quirky, funny, and surprisingly thought-provoking. The performances are top-notch, and it’s a visual feast. I didn’t expect to love it this much!",
      "second-name": "Jake Collins",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "While fun, the movie was a bit too surreal for my taste. It had great moments, but I felt the narrative was more style over substance at times."
    },
    {
      "id": 32,
      "title": "Joy Ride",
      "poster": "joy-ride.jpeg",
      "year": "2023",
      "genre": "comedy, adventure",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Four Asian-American friends embark on a wild adventure in Asia, encountering unexpected situations while rediscovering their true selves and strengthening their bond.",
      "our-review": "A delightful and hilarious road trip comedy that blends humor with heartfelt moments. The strong performances from the cast bring authenticity to the story, making it both fun and meaningful.",
      "cast": "Ashley Park, Sherry Cola, Stephanie Hsu",
      "first-name": "Carmen Lee",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A fresh and hilarious take on the road trip comedy genre. The characters are lovable, and the movie tackles important themes with humor and grace.",
      "second-name": "Liam O’Connell",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "I enjoyed the humor, but some of the plot points felt a bit predictable. Nonetheless, the chemistry between the leads makes it an enjoyable watch."
    },
    {
      "id": 33,
      "title": "Strays",
      "poster": "strays.jpeg",
      "year": "2023",
      "genre": "comedy, animation",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "When a stray dog discovers that his owner has abandoned him, he teams up with other stray dogs to live life on their own terms and take revenge on their former human.",
      "our-review": "A hilarious and heartwarming animated adventure for adults. The comedy is sharp and the animation is vibrant. It’s surprisingly emotional at times, with a great message about independence and friendship.",
      "cast": "Will Ferrell, Jamie Foxx, Isla Fisher",
      "first-name": "Peter Griffith",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "An unexpectedly funny and heartwarming adventure that had me laughing throughout. The voice cast is excellent, and the animation is impressive.",
      "second-name": "Linda Hughes",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "While the humor is great, I felt the storyline was a little too predictable. Still, it’s a fun ride with a great message about loyalty and friendship."
    },
    {
      "id": 34,
      "title": "Bottoms",
      "poster": "bottoms.jpeg",
      "year": "2023",
      "genre": "comedy, teen",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Two high school girls start a fight club to get closer to their crushes, but things spiral out of control as they gain popularity and face unexpected consequences.",
      "our-review": "A hilarious and bold coming-of-age comedy that challenges stereotypes and conventions. The performances from the leads are exceptional, and the humor is both edgy and heartfelt.",
      "cast": "Rachel Sennott, Ayo Edebiri, Havana Rose Liu",
      "first-name": "Maya Foster",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A sharp, funny, and unapologetically bold film. It’s refreshing to see a teen comedy with such an edgy twist. The performances are top-notch, and the humor hits hard.",
      "second-name": "Ben Thompson",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "While funny, the movie sometimes feels like it pushes the envelope a bit too far. Nonetheless, it's a fresh take on the teen comedy genre."
    },
    {
      "id": 35,
      "title": "You People",
      "poster": "you-people.jpeg",
      "year": "2023",
      "genre": "comedy, romance",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A couple from different cultural backgrounds must navigate their families' cultural clashes and their relationship's future in this comedic exploration of love and identity.",
      "our-review": "A smart and witty exploration of cultural differences in modern relationships. The cast delivers strong performances, and the comedy is both sharp and insightful.",
      "cast": "Jonah Hill, Lauren London, Eddie Murphy",
      "first-name": "Kimberly Adams",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A hilarious and smart romantic comedy that sheds light on cultural clashes with humor. The performances are fantastic, and the writing is sharp.",
      "second-name": "Chad Miller",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "I enjoyed the chemistry between the leads, but I felt the pacing was a bit slow. The humor is great, but the movie could have been more streamlined."
    },
    {
      "id": 36,
      "title": "Quiz Lady",
      "poster": "quiz-lady.jpeg",
      "year": "2023",
      "genre": "comedy, family",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Two estranged sisters team up to compete on a popular quiz show in order to save their family business and bond over shared memories from their childhood.",
      "our-review": "A heartwarming and humorous film that combines family drama with comedy. The performances are heartfelt, and the story is both funny and emotionally resonant.",
      "cast": "Sandra Oh, Awkwafina, Jason Schwartzman",
      "first-name": "Olivia Green",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A delightful and emotional film with great performances from the cast. It’s funny and warm-hearted, with a bit of nostalgia for anyone who’s ever had a sibling rivalry.",
      "second-name": "Daniel Hughes",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "The movie was enjoyable, but at times it felt a bit predictable. Nonetheless, the cast makes it fun, and the family dynamics are relatable."
    },
    {
      "id": 37,
      "title": "Dumb Money",
      "poster": "dumb-money.jpeg",
      "year": "2023",
      "genre": "comedy, drama",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Based on the true story of the GameStop stock short squeeze, this film follows a group of individual investors who take on Wall Street in a comedic and dramatic fight for financial freedom.",
      "our-review": "An exciting and hilarious look at the GameStop saga, with great performances and a sharp script. The film captures the absurdity of the stock market and the culture of financial manipulation.",
      "cast": "Paul Dano, Seth Rogen, Pete Davidson",
      "first-name": "Jessica Adams",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A compelling and entertaining film that takes a complex subject and makes it accessible and fun. The performances are fantastic, and it’s surprisingly emotional at times.",
      "second-name": "Michael Davis",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "The story is fascinating, but the pacing sometimes drags. Still, it’s a humorous and insightful look at a recent piece of financial history."
    },
    {
      "id": 38,
      "title": "Leo",
      "poster": "leo.jpeg",
      "year": "2023",
      "genre": "comedy, animation",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Leo, a class pet in an elementary school, embarks on an adventure with his friends to navigate the challenges of being a classroom mascot while also learning valuable lessons about life and friendship.",
      "our-review": "A heartwarming and funny animated film that both children and adults can enjoy. The animation is stunning, and the story delivers important life lessons with a healthy dose of humor.",
      "cast": "Adam Sandler, Bill Burr, Cecily Strong",
      "first-name": "Sophia Turner",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A charming and funny animated film with a great message about friendship and growing up. The voice cast is stellar, and it’s perfect for family viewing.",
      "second-name": "David Miller",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "A cute and entertaining animated film, but it didn’t quite deliver the emotional depth I was expecting. Nonetheless, the humor is spot-on for kids."
    },
    {
      "id": 39,
      "title": "Murder Mystery 2",
      "poster": "murder-mystery-2.jpeg",
      "year": "2023",
      "genre": "comedy, mystery",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Detectives Nick and Audrey Spitz return to solve another high-profile case, this time involving the kidnapping of a wealthy billionaire at his lavish destination wedding.",
      "our-review": "A fun and lighthearted sequel to the original, with more twists, more humor, and a larger-than-life setting. The chemistry between the leads makes it enjoyable, even if the mystery itself is a bit predictable.",
      "cast": "Adam Sandler, Jennifer Aniston, Mark Strong",
      "first-name": "Tina Williams",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A hilarious and entertaining mystery film that keeps you guessing. The performances are great, and the plot, while predictable, still offers plenty of laughs.",
      "second-name": "Lucas Brown",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "It’s fun but a bit formulaic. Still, it’s a lighthearted and entertaining watch for fans of comedy and mystery."
    },
      {
        "id": 70,
        "title": "Inception",
        "poster": "inception.jpeg",
        "year": "2010",
        "genre": "action, sci-fi, thriller",
        "rating": "⭐️⭐️⭐️⭐️⭐️",
        "summary": "A skilled thief is offered a chance at redemption if he can successfully perform inception—planting an idea into a target's subconscious.",
        "our-review": "A mind-bending masterpiece that combines intricate storytelling with stunning visuals. Nolan's direction keeps viewers engaged through every twist and turn.",
        "cast": "Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen Page",
        "first-name": "Alex Johnson",
        "first-rating": "⭐️⭐️⭐️⭐️⭐️",
        "first-review": "An intellectual thrill ride that challenges perceptions of reality.",
        "second-name": "Maria Gonzalez",
        "second-rating": "⭐️⭐️⭐️⭐️",
        "second-review": "Complex but rewarding; requires multiple viewings to fully grasp."
      },
      {
        "id": 71,
        "title": "Parasite",
        "poster": "parasite.jpeg",
        "year": "2019",
        "genre": "drama, thriller",
        "rating": "⭐️⭐️⭐️⭐️⭐️",
        "summary": "A poor family schemes to become employed by a wealthy household by infiltrating their domestic staff, leading to unforeseen consequences.",
        "our-review": "A brilliant social commentary wrapped in suspense and dark humor. Bong Joon-ho delivers a cinematic experience that's both entertaining and thought-provoking.",
        "cast": "Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong",
        "first-name": "Emily Davis",
        "first-rating": "⭐️⭐️⭐️⭐️⭐️",
        "first-review": "A masterful blend of genres that keeps you on the edge of your seat.",
        "second-name": "James Lee",
        "second-rating": "⭐️⭐️⭐️⭐️",
        "second-review": "An insightful look into class disparities with unexpected twists."
      },
      {
        "id": 72,
        "title": "The Grand Budapest Hotel",
        "poster": "the-grand-budapest-hotel.jpeg",
        "year": "2014",
        "genre": "comedy, drama",
        "rating": "⭐️⭐️⭐️⭐️",
        "summary": "The adventures of Gustave H, a legendary concierge at a famous European hotel between the wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend.",
        "our-review": "Wes Anderson's visually stunning film is a whimsical tale filled with eccentric characters and a poignant narrative.",
        "cast": "Ralph Fiennes, Tony Revolori, Saoirse Ronan",
        "first-name": "Laura Mitchell",
        "first-rating": "⭐️⭐️⭐️⭐️",
        "first-review": "A delightful and quirky film with impeccable production design.",
        "second-name": "Daniel Thompson",
        "second-rating": "⭐️⭐️⭐️",
        "second-review": "Visually captivating, though the story felt a bit meandering at times."
      },
      {
        "id": 73,
        "title": "Mad Max: Fury Road",
        "poster": "mad-max-fury-road.jpeg",
        "year": "2015",
        "genre": "action, adventure, sci-fi",
        "rating": "⭐️⭐️⭐️⭐️⭐️",
        "summary": "In a post-apocalyptic wasteland, Max teams up with Furiosa to flee from a tyrant and his army in a high-octane chase.",
        "our-review": "A relentless and visually stunning action film that reinvents the franchise with a fresh and feminist perspective.",
        "cast": "Tom Hardy, Charlize Theron, Nicholas Hoult",
        "first-name": "Samantha Lee",
        "first-rating": "⭐️⭐️⭐️⭐️⭐️",
        "first-review": "An adrenaline-fueled masterpiece with breathtaking visuals.",
        "second-name": "Brian Kim",
        "second-rating": "⭐️⭐️⭐️⭐️",
        "second-review": "Non-stop action that keeps you on the edge of your seat."
      },
      {
        "id": 74,
        "title": "La La Land",
        "poster": "la-la-land.jpeg",
        "year": "2016",
        "genre": "comedy, drama, music",
        "rating": "⭐️⭐️⭐️⭐️",
        "summary": "A jazz musician and an aspiring actress fall in love while pursuing their dreams in Los Angeles.",
        "our-review": "A modern musical that pays homage to classic Hollywood while delivering a heartfelt story of love and ambition.",
        "cast": "Ryan Gosling, Emma Stone, John Legend",
        "first-name": "Olivia Brown",
        "first-rating": "⭐️⭐️⭐️⭐️",
        "first-review": "A charming and beautifully shot film with memorable performances.",
        "second-name": "Michael Chen",
        "second-rating": "⭐️⭐️⭐️",
        "second-review": "Great music and visuals, though the story felt a bit predictable."
      },
      {
        "id": 75,
        "title": "Get Out",
        "poster": "get-out.jpeg",
        "year": "2017",
        "genre": "horror, mystery, thriller",
        "rating": "⭐️⭐️⭐️⭐️⭐️",
        "summary": "A young African-American man visits his white girlfriend's family estate, uncovering a disturbing secret.",
        "our-review": "A groundbreaking horror film that combines social commentary with suspenseful storytelling.",
        "cast": "Daniel Kaluuya, Allison Williams, Bradley Whitford",
        "first-name": "Jessica Nguyen",
        "first-rating": "⭐️⭐️⭐️⭐️⭐️",
        "first-review": "A thought-provoking and chilling film that stays with you.",
        "second-name": "David Park",
        "second-rating": "⭐️⭐️⭐️⭐️",
        "second-review": "Masterfully blends horror with sharp social insights."
      },
      {
        "id": 76,
        "title": "The Social Network",
        "poster": "the-social-network.jpeg",
        "year": "2010",
        "genre": "biography, drama",
        "rating": "⭐️⭐️⭐️⭐️",
        "summary": "The story of Facebook's founding and the legal battles that followed.",
        "our-review": "A compelling look at ambition, friendship, and betrayal in the digital age.",
        "cast": "Jesse Eisenberg, Andrew Garfield, Justin Timberlake",
        "first-name": "Emily Carter",
        "first-rating": "⭐️⭐️⭐️⭐️",
        "first-review": "Engaging and well-acted, with a sharp script.",
        "second-name": "Robert Lee",
        "second-rating": "⭐️⭐️⭐️",
        "second-review": "Informative, though it takes some creative liberties."
      },
      {
        "id": 77,
        "title": "The Shape of Water",
        "poster": "the-shape-of-water.jpeg",
        "year": "2017",
        "genre": "drama, fantasy, romance",
        "rating": "⭐️⭐️⭐️⭐️",
        "summary": "A mute woman forms a unique relationship with a mysterious aquatic creature held in captivity.",
        "our-review": "A beautifully crafted fairy tale that explores love and acceptance.",
        "cast": "Sally Hawkins, Octavia Spencer, Michael Shannon",
        "first-name": "Laura Simmons",
        "first-rating": "⭐️⭐️⭐️⭐️",
        "first-review": "Enchanting and emotionally resonant.",
        "second-name": "Thomas Nguyen",
        "second-rating": "⭐️⭐️⭐️",
        "second-review": "Visually stunning, though the story may not appeal to everyone."
      },
      {
        "id": 78,
        "title": "Moonlight",
        "poster": "moonlight.jpeg",
        "year": "2016",
        "genre": "drama",
        "rating": "⭐️⭐️⭐️⭐️⭐️",
        "summary": "A young African-American man grapples with his identity and sexuality while experiencing the everyday struggles of childhood, adolescence, and adulthood.",
        "our-review": "A poignant and beautifully told story that resonates deeply.",
        "cast": "Mahershala Ali, Naomie Harris, Trevante Rhodes",
        "first-name": "Angela Martinez",
        "first-rating": "⭐️⭐️⭐️⭐️⭐️",
        "first-review": "Heartfelt and masterfully acted.",
        "second-name": "Kevin Brooks",
        "second-rating": "⭐️⭐️⭐️⭐️",
        "second-review": "A moving portrayal of personal growth and self-discovery."
      },
      {
        "id": 79,
        "title": "Joker",
        "poster": "joker.jpeg",
        "year": "2019",
        "genre": "crime, drama, thriller",
        "rating": "⭐️⭐️⭐️⭐️",
        "summary": "In Gotham City, a mentally troubled comedian embarks on a downward spiral that leads to the creation of an iconic villain.",
        "our-review": "A dark and intense character study with a standout performance by Joaquin Phoenix.",
        "cast": "Joaquin Phoenix, Robert De Niro, Zazie Beetz",
        "first-name": "Rachel Adams",
        "first-rating": "⭐️⭐️⭐️⭐️",
        "first-review": "A haunting and powerful film.",
        "second-name": "Mark Thompson",
        "second-rating": "⭐️⭐️⭐️",
        "second-review": "Compelling, though its bleakness may not be for everyone."
      },
        {
          "id": 80,
          "title": "Black Panther",
          "poster": "black-panther.jpeg",
          "year": "2018",
          "genre": "action, superhero",
          "rating": "⭐️⭐️⭐️⭐️⭐️",
          "summary": "T'Challa returns home to Wakanda to take his place as king, but faces a powerful adversary who challenges his right to the throne.",
          "our-review": "A groundbreaking Marvel film that blends cultural pride with thrilling superhero action. Stunning visuals and an iconic performance by Chadwick Boseman.",
          "cast": "Chadwick Boseman, Michael B. Jordan, Lupita Nyong’o",
          "first-name": "Alex Carter",
          "first-rating": "⭐️⭐️⭐️⭐️⭐️",
          "first-review": "A visually stunning and emotionally resonant film. One of Marvel’s best.",
          "second-name": "Emily Ross",
          "second-rating": "⭐️⭐️⭐️⭐️",
          "second-review": "Great action and a meaningful story. The villain is one of the strongest in the MCU."
        },
        {
          "id": 81,
          "title": "Interstellar",
          "poster": "interstellar.jpeg",
          "year": "2014",
          "genre": "sci-fi, drama",
          "rating": "⭐️⭐️⭐️⭐️⭐️",
          "summary": "A group of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
          "our-review": "Christopher Nolan’s epic space odyssey combines emotion, science, and visual grandeur in a deeply moving film.",
          "cast": "Matthew McConaughey, Anne Hathaway, Jessica Chastain",
          "first-name": "Marcus Lee",
          "first-rating": "⭐️⭐️⭐️⭐️⭐️",
          "first-review": "A mind-bending and emotional film with stunning visuals and an incredible score.",
          "second-name": "Natalie Kim",
          "second-rating": "⭐️⭐️⭐️⭐️",
          "second-review": "Beautiful and thought-provoking, though some of the science can be overwhelming."
        },
        {
          "id": 82,
          "title": "Whiplash",
          "poster": "whiplash.jpeg",
          "year": "2014",
          "genre": "drama, music",
          "rating": "⭐️⭐️⭐️⭐️⭐️",
          "summary": "A young drummer enrolls at a music conservatory where his instructor pushes him to the brink of his ability—and sanity.",
          "our-review": "An intense exploration of ambition and abuse, powered by powerhouse performances and electrifying music.",
          "cast": "Miles Teller, J.K. Simmons, Paul Reiser",
          "first-name": "Sara Mitchell",
          "first-rating": "⭐️⭐️⭐️⭐️⭐️",
          "first-review": "Brilliant, intense, and emotionally gripping. Simmons is terrifyingly good.",
          "second-name": "James Taylor",
          "second-rating": "⭐️⭐️⭐️⭐️",
          "second-review": "A raw look at what it takes to be great. The tension is palpable throughout."
        },
        {
          "id": 83,
          "title": "The Martian",
          "poster": "the-martian.jpeg",
          "year": "2015",
          "genre": "sci-fi, adventure",
          "rating": "⭐️⭐️⭐️⭐️",
          "summary": "An astronaut becomes stranded on Mars and must rely on his ingenuity to survive until rescue.",
          "our-review": "Smart, funny, and scientifically fascinating. A crowd-pleasing space survival story with heart.",
          "cast": "Matt Damon, Jessica Chastain, Jeff Daniels",
          "first-name": "Laura Bennett",
          "first-rating": "⭐️⭐️⭐️⭐️",
          "first-review": "Damon is fantastic. A surprisingly funny and hopeful survival story.",
          "second-name": "Henry West",
          "second-rating": "⭐️⭐️⭐️⭐️",
          "second-review": "A great mix of science and humanity. You’re rooting for him the whole time."
        },
        {
          "id": 84,
          "title": "Arrival",
          "poster": "arrival.jpeg",
          "year": "2016",
          "genre": "sci-fi, drama",
          "rating": "⭐️⭐️⭐️⭐️",
          "summary": "A linguist is recruited to communicate with alien visitors, unraveling profound truths about time and humanity.",
          "our-review": "A thoughtful and poetic sci-fi film that challenges perceptions and rewards patient viewers.",
          "cast": "Amy Adams, Jeremy Renner, Forest Whitaker",
          "first-name": "Isabella Ford",
          "first-rating": "⭐️⭐️⭐️⭐️",
          "first-review": "Beautiful and thought-provoking. Not your typical alien movie.",
          "second-name": "George Collins",
          "second-rating": "⭐️⭐️⭐️",
          "second-review": "Takes its time, but worth it. Emotionally powerful and visually stunning."
        },
        {
          "id": 85,
          "title": "Her",
          "poster": "her.jpeg",
          "year": "2013",
          "genre": "romance, sci-fi",
          "rating": "⭐️⭐️⭐️⭐️⭐️",
          "summary": "A lonely man develops a relationship with an AI operating system designed to meet his every need.",
          "our-review": "An intimate and deeply moving exploration of love and technology with a standout lead performance.",
          "cast": "Joaquin Phoenix, Scarlett Johansson, Amy Adams",
          "first-name": "Olivia Shaw",
          "first-rating": "⭐️⭐️⭐️⭐️⭐️",
          "first-review": "Beautiful, sad, and relevant. One of the most human stories about technology.",
          "second-name": "Liam Brooks",
          "second-rating": "⭐️⭐️⭐️⭐️",
          "second-review": "Unique and emotional. Phoenix gives a deeply affecting performance."
        },
        {
          "id": 86,
          "title": "The Revenant",
          "poster": "the-revenant.jpeg",
          "year": "2015",
          "genre": "drama, adventure",
          "rating": "⭐️⭐️⭐️⭐️",
          "summary": "A frontiersman fights for survival after being left for dead in the wilderness.",
          "our-review": "A visually stunning, brutal tale of endurance and revenge, led by an unforgettable performance from DiCaprio.",
          "cast": "Leonardo DiCaprio, Tom Hardy, Domhnall Gleeson",
          "first-name": "Benjamin Clark",
          "first-rating": "⭐️⭐️⭐️⭐️",
          "first-review": "Raw and intense. DiCaprio’s performance is all heart and grit.",
          "second-name": "Madeline Young",
          "second-rating": "⭐️⭐️⭐️⭐️",
          "second-review": "Beautiful and harrowing. The cinematography alone is worth watching."
        },
        {
          "id": 87,
          "title": "Birdman",
          "poster": "birdman.jpeg",
          "year": "2014",
          "genre": "drama, comedy",
          "rating": "⭐️⭐️⭐️⭐️⭐️",
          "summary": "A washed-up actor, famous for playing a superhero, struggles to revive his career on Broadway.",
          "our-review": "A brilliantly shot, darkly humorous film with deep commentary on fame and ego.",
          "cast": "Michael Keaton, Edward Norton, Emma Stone",
          "first-name": "Nathan Hill",
          "first-rating": "⭐️⭐️⭐️⭐️⭐️",
          "first-review": "A unique and mesmerizing film. The long takes are masterful.",
          "second-name": "Rachel King",
          "second-rating": "⭐️⭐️⭐️⭐️",
          "second-review": "Weird and wonderful. Keaton is in top form."
        },
        {
          "id": 88,
          "title": "Spotlight",
          "poster": "spotlight.jpeg",
          "year": "2015",
          "genre": "drama, biography",
          "rating": "⭐️⭐️⭐️⭐️⭐️",
          "summary": "The true story of how a team of journalists uncovered a massive child molestation scandal within the Catholic Church.",
          "our-review": "A powerful and well-acted newsroom drama that honors the importance of investigative journalism.",
          "cast": "Mark Ruffalo, Michael Keaton, Rachel McAdams",
          "first-name": "Ethan Ross",
          "first-rating": "⭐️⭐️⭐️⭐️⭐️",
          "first-review": "An important and chilling film. So well told.",
          "second-name": "Chloe Wright",
          "second-rating": "⭐️⭐️⭐️⭐️",
          "second-review": "Tense, emotional, and respectful of the victims. A must-watch."
        },
        {
          "id": 89,
          "title": "The Big Short",
          "poster": "the-big-short.jpeg",
          "year": "2015",
          "genre": "comedy, drama",
          "rating": "⭐️⭐️⭐️⭐️",
          "summary": "A group of outsiders foresee the 2008 financial crisis and take on the big banks for their greed and corruption.",
          "our-review": "A sharp and clever explanation of the housing bubble, with great performances and fourth-wall-breaking humor.",
          "cast": "Christian Bale, Steve Carell, Ryan Gosling",
          "first-name": "Ava Martin",
          "first-rating": "⭐️⭐️⭐️⭐️",
          "first-review": "Funny, infuriating, and insightful. Makes complex topics easy to understand.",
          "second-name": "Logan Reed",
          "second-rating": "⭐️⭐️⭐️",
          "second-review": "Engaging, though sometimes chaotic. Still very eye-opening."
        },
          {
            "id": 90,
            "title": "Room",
            "poster": "room.jpeg",
            "year": "2015",
            "genre": "drama, thriller",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "A young boy and his mother are held captive in a room for seven years before finally escaping, and they must adjust to the outside world.",
            "our-review": "A gripping and emotionally intense film that explores the bond between mother and son under unimaginable circumstances. The performances, especially by Brie Larson, are stunning.",
            "cast": "Brie Larson, Jacob Tremblay, Joan Allen",
            "first-name": "Sophia Turner",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "A beautifully crafted, emotionally powerful film. The performances are mesmerizing, particularly from the young Tremblay. It’s a difficult watch, but worth every second.",
            "second-name": "David Miller",
            "second-rating": "⭐️⭐️⭐️⭐️",
            "second-review": "A harrowing and emotional journey. The pacing can be slow, but the strong performances make it a must-watch."
          },
          {
            "id": 91,
            "title": "Brooklyn",
            "poster": "brooklyn.jpeg",
            "year": "2015",
            "genre": "drama, romance",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "An Irish immigrant in 1950s Brooklyn must choose between two men and two countries as she finds her place in the world.",
            "our-review": "A heartfelt, moving story about love and belonging. Saoirse Ronan delivers an exceptional performance in this beautifully crafted period drama.",
            "cast": "Saoirse Ronan, Emory Cohen, Domhnall Gleeson",
            "first-name": "Emily Rose",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "An evocative and well-paced drama that explores themes of love, identity, and immigration. Ronan’s performance is a standout.",
            "second-name": "Oliver Harris",
            "second-rating": "⭐️⭐️⭐️",
            "second-review": "While the film is well-executed, I found the pacing a bit slow at times. Nonetheless, the story is touching and offers strong performances."
          },
          {
            "id": 92,
            "title": "The Imitation Game",
            "poster": "the-imitation-game.jpeg",
            "year": "2014",
            "genre": "biography, drama, thriller",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "Based on the true story of Alan Turing, the brilliant mathematician who cracked the Nazi codes during WWII but was persecuted for his homosexuality.",
            "our-review": "An intriguing and powerful portrayal of Alan Turing’s life and his significant contributions to the war effort. Cumberbatch’s performance is brilliant and moving.",
            "cast": "Benedict Cumberbatch, Keira Knightley, Matthew Goode",
            "first-name": "Lucas Brown",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "A brilliant performance by Cumberbatch and a fascinating, tragic story. It’s a well-crafted and deeply engaging film about Turing’s struggles and genius.",
            "second-name": "Jessica Adams",
            "second-rating": "⭐️⭐️⭐️",
            "second-review": "While the story is captivating, the film could have explored more of Turing’s personal life in depth. Still, Cumberbatch’s performance makes it worth watching."
          },
          {
            "id": 93,
            "title": "The Theory of Everything",
            "poster": "the-theory-of-everything.jpeg",
            "year": "2014",
            "genre": "biography, drama, romance",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "The story of renowned physicist Stephen Hawking’s life, focusing on his relationship with his first wife, Jane, and his groundbreaking work on black holes.",
            "our-review": "An inspiring film that showcases the remarkable life of Stephen Hawking. Eddie Redmayne’s performance is truly transformative and deserving of all accolades.",
            "cast": "Eddie Redmayne, Felicity Jones, Charlie Cox",
            "first-name": "Chad Miller",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "A deeply moving film that captures the essence of Stephen Hawking’s life. Redmayne’s portrayal of Hawking is extraordinary and heartfelt.",
            "second-name": "Olivia Green",
            "second-rating": "⭐️⭐️⭐️⭐️",
            "second-review": "An inspiring biographical drama. The chemistry between Redmayne and Jones elevates the film. A must-watch for fans of biographical stories."
          },
          {
            "id": 94,
            "title": "Selma",
            "poster": "selma.jpeg",
            "year": "2014",
            "genre": "biography, drama, history",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "The film chronicles the events surrounding the 1965 Selma to Montgomery voting rights marches led by Dr. Martin Luther King Jr.",
            "our-review": "A powerful and emotional retelling of the events that changed America. The performances are outstanding, and the film gives a human face to the struggle for civil rights.",
            "cast": "David Oyelowo, Carmen Ejogo, Tom Wilkinson",
            "first-name": "Daniel Hughes",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "An essential historical film that brings the Civil Rights movement to life. Oyelowo’s performance as Dr. King is incredible and the film’s message is as relevant today as ever.",
            "second-name": "Sophia Turner",
            "second-rating": "⭐️⭐️⭐️",
            "second-review": "A powerful story about the Selma marches. While the movie is impactful, it’s a bit slow in parts. Nonetheless, it’s an important and emotional watch."
          },
          {
            "id": 95,
            "title": "American Sniper",
            "poster": "american-sniper.jpeg",
            "year": "2014",
            "genre": "biography, drama, war",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "The true story of Chris Kyle, a Navy SEAL sniper with the most confirmed kills by a sniper in U.S. military history, and the toll his service takes on his life.",
            "our-review": "A powerful and intense war film that explores the human cost of war. Bradley Cooper delivers a gripping performance as Chris Kyle, and the film doesn’t shy away from the psychological effects of war.",
            "cast": "Bradley Cooper, Sienna Miller, Kyle Gallner",
            "first-name": "Lucas Brown",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "An intense and emotional portrayal of war and its toll on soldiers. Cooper’s performance is exceptional, and the film is a haunting depiction of PTSD and sacrifice.",
            "second-name": "Emily Rose",
            "second-rating": "⭐️⭐️⭐️",
            "second-review": "A solid war film with strong performances, but I felt the pacing could have been tighter. Still, it’s a gripping and emotional story."
          },
          {
            "id": 96,
            "title": "Boyhood",
            "poster": "boyhood.jpeg",
            "year": "2014",
            "genre": "drama",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "Filmed over 12 years, this groundbreaking drama follows the life of a young boy from childhood to his first year of college, capturing the challenges and changes of growing up.",
            "our-review": "A truly unique cinematic experience. The 12-year filming process results in a deeply authentic portrayal of growing up, and the film’s natural pace makes it feel like a documentary of a life well-lived.",
            "cast": "Ellar Coltrane, Patricia Arquette, Ethan Hawke",
            "first-name": "Tina Williams",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "An incredible, one-of-a-kind film. The way the characters evolve over the years is captivating, and the performances are raw and genuine.",
            "second-name": "Daniel Hughes",
            "second-rating": "⭐️⭐️⭐️",
            "second-review": "A long but powerful exploration of growing up. The format is unique, and it’s a refreshing take on the coming-of-age genre."
          },
          {
            "id": 97,
            "title": "The Hateful Eight",
            "poster": "the-hateful-eight.jpeg",
            "year": "2015",
            "genre": "drama, mystery, western",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "In the Wyoming winter, eight strangers with secrets are trapped together in a stagecoach stopover and must decide who can be trusted as tensions escalate.",
            "our-review": "A tense and atmospheric western with a typical Tarantino twist. The dialogue is sharp, the characters are richly developed, and the suspense is electric throughout.",
            "cast": "Samuel L. Jackson, Kurt Russell, Jennifer Jason Leigh",
            "first-name": "Lucas Brown",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "A masterclass in suspense and character-driven drama. Tarantino delivers yet another gripping film with fantastic performances all around.",
            "second-name": "Chad Miller",
            "second-rating": "⭐️⭐️⭐️",
            "second-review": "While the dialogue is brilliant, the pacing can feel slow at times. The film builds tension beautifully, but I was hoping for a bit more action."
          },
          {
            "id": 98,
            "title": "Bridge of Spies",
            "poster": "bridge-of-spies.jpeg",
            "year": "2015",
            "genre": "drama, history, thriller",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "During the Cold War, a Brooklyn lawyer negotiates the exchange of spies between the U.S. and the Soviet Union, navigating political tensions and moral dilemmas.",
            "our-review": "A well-crafted, tense drama that shows the complex world of espionage during the Cold War. Spielberg’s direction is flawless, and Tom Hanks gives a standout performance.",
            "cast": "Tom Hanks, Mark Rylance, Amy Ryan",
            "first-name": "Emily Rose",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "A thought-provoking historical drama with a brilliant performance by Rylance. Spielberg delivers another gripping film about morality and politics.",
            "second-name": "Sophia Turner",
            "second-rating": "⭐️⭐️⭐️",
            "second-review": "A solid film with great performances, but at times it felt a little drawn out. Still, it’s a gripping portrayal of a tense moment in history."
          },
          {
            "id": 99,
            "title": "Inside Out",
            "poster": "inside-out.jpeg",
            "year": "2015",
            "genre": "animation, adventure, comedy",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "Inside the mind of a young girl, five personified emotions—Joy, Sadness, Anger, Fear, and Disgust—help her navigate the challenges of growing up.",
            "our-review": "A heartwarming and innovative animated film that beautifully captures the complexities of emotions and growing up. The animation is top-notch, and the message is both entertaining and meaningful.",
            "cast": "Amy Poehler, Phyllis Smith, Bill Hader",
            "first-name": "Tina Williams",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "An incredibly creative and emotionally intelligent film that resonates with both kids and adults. The performances and animation are fantastic.",
            "second-name": "Chad Miller",
            "second-rating": "⭐️⭐️⭐️⭐️",
            "second-review": "A brilliant and imaginative take on childhood and emotions. It's an enjoyable family film with a touching message that stays with you long after the credits roll."
          }
        
        
      ]
    },
    {
      "id": 40,
      "title": "The Nun 2",
      "poster": "the-nun-2.jpeg",
      "year": "2023",
      "genre": "horror, mystery",
      "rating": "⭐️⭐️⭐️",
      "summary": "In the sequel to the chilling original, Sister Irene returns to confront an evil force once again as she uncovers more terrifying secrets within the church.",
      "our-review": "While not as groundbreaking as the first, The Nun 2 maintains a creepy aesthetic and suspenseful pacing. Fans of the Conjuring universe will enjoy the expanding lore.",
      "cast": "Taissa Farmiga, Jonas Bloquet, Storm Reid",
      "first-name": "Nina Harper",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A solid sequel with some genuinely scary moments. The atmosphere is thick with dread, and Farmiga delivers another strong performance.",
      "second-name": "Elliot Grant",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "It had some scares, but it lacked the originality of the first film. Still, a decent entry in the franchise."
    },
    {
      "id": 41,
      "title": "Talk to Me",
      "poster": "talk-to-me.jpeg",
      "year": "2023",
      "genre": "horror, thriller",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A group of teens discovers how to summon spirits using an embalmed hand, but things spiral out of control when one of them opens the door to something sinister.",
      "our-review": "An inventive and intense horror film that cleverly blends teen drama with supernatural terror. A fresh take on possession tropes.",
      "cast": "Sophie Wilde, Joe Bird, Alexandra Jensen",
      "first-name": "Maya Lin",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Really unique concept with great execution. It kept me on edge the whole time.",
      "second-name": "Caleb Morris",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A creative and chilling movie that taps into fears of losing control. Loved the acting and visuals."
    },
    {
      "id": 42,
      "title": "Insidious: The Red Door",
      "poster": "insidious-the-red-door.jpeg",
      "year": "2023",
      "genre": "horror",
      "rating": "⭐️⭐️⭐️",
      "summary": "The Lambert family returns to confront their demons one last time, unlocking the secrets behind the red door that has haunted them for years.",
      "our-review": "While it's a nostalgic return to the original characters, the scares feel a bit recycled. Still, it offers closure for longtime fans.",
      "cast": "Patrick Wilson, Ty Simpkins, Rose Byrne",
      "first-name": "Lara Connors",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "A bit predictable but enjoyable for fans of the series.",
      "second-name": "Reggie Hall",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "Not the best of the series, but it ties up the story well and has its fair share of creepy scenes."
    },
    {
      "id": 43,
      "title": "Cobweb",
      "poster": "cobweb.jpeg",
      "year": "2023",
      "genre": "horror, mystery",
      "rating": "⭐️⭐️⭐️",
      "summary": "A young boy hears mysterious knocks from inside the walls of his home, uncovering dark secrets his parents desperately tried to bury.",
      "our-review": "A creepy and claustrophobic tale with strong performances, especially from the child actor. The pacing falters slightly, but the eerie buildup pays off.",
      "cast": "Woody Norman, Lizzy Caplan, Antony Starr",
      "first-name": "Janelle Park",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Cobweb had a great blend of psychological tension and supernatural horror. The ending caught me off guard!",
      "second-name": "Damien West",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Good concept, but some parts felt underdeveloped. Still, a solid scary movie night choice."
    },
    {
      "id": 44,
      "title": "The Boogeyman",
      "poster": "the-boogeyman.jpeg",
      "year": "2023",
      "genre": "horror, thriller",
      "rating": "⭐️⭐️⭐️",
      "summary": "Two sisters confront a terrifying creature born from grief and trauma, which stalks them in the shadows after the sudden death of their mother.",
      "our-review": "Inspired by Stephen King's short story, this film delivers suspenseful moments but doesn’t fully escape the formulaic horror path. Great atmosphere though.",
      "cast": "Sophie Thatcher, Chris Messina, Vivien Lyra Blair",
      "first-name": "Tara Singh",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "Some creepy scenes and good acting, but I was hoping for a more original twist.",
      "second-name": "Miles Carter",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "I found it surprisingly emotional. The creature design was chilling!"
    },
    {
      "id": 45,
      "title": "Thanksgiving",
      "poster": "thanksgiving.jpeg",
      "year": "2023",
      "genre": "horror, slasher",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "After a Black Friday riot turns deadly, a mysterious killer begins targeting residents of Plymouth, Massachusetts in the lead-up to Thanksgiving.",
      "our-review": "A delightfully gory and darkly funny slasher from Eli Roth, embracing holiday horror in all the best (and worst) ways.",
      "cast": "Patrick Dempsey, Addison Rae, Milo Manheim",
      "first-name": "Jess Rowe",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Bloody, brutal, and hilarious. Loved the holiday theme.",
      "second-name": "Omar Delgado",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Not for the faint-hearted. Classic slasher fans will love it, but it’s not breaking new ground."
    },
    {
      "id": 46,
      "title": "The Exorcist: Believer",
      "poster": "the-exorcist-believer.jpeg",
      "year": "2023",
      "genre": "horror, supernatural",
      "rating": "⭐️⭐️⭐️",
      "summary": "A father seeks help after his daughter begins exhibiting terrifying behavior, uncovering ties to an ancient evil linked to the original exorcism decades ago.",
      "our-review": "A spiritual sequel to the 1973 classic, it brings back some legacy characters but doesn’t quite recapture the original’s depth or horror.",
      "cast": "Leslie Odom Jr., Lidya Jewett, Ellen Burstyn",
      "first-name": "Kelsey Tran",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "It had a few chilling scenes, but felt too focused on fan service.",
      "second-name": "David Moon",
      "second-rating": "⭐️⭐️",
      "second-review": "Disappointed. It lacked the psychological punch that made the first so iconic."
    },
    {
      "id": 47,
      "title": "Five Nights at Freddy's",
      "poster": "five-nights-at-freddys.jpeg",
      "year": "2023",
      "genre": "horror, video game adaptation",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A troubled security guard begins working night shifts at Freddy Fazbear's Pizza, only to discover the animatronics come to life with murderous intent.",
      "our-review": "A faithful and fun adaptation of the beloved game. While not deeply terrifying, it nails the creepy nostalgia and animatronic horror perfectly.",
      "cast": "Josh Hutcherson, Elizabeth Lail, Matthew Lillard",
      "first-name": "Carlos Vega",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Nailed the creepy vibe of the games. Great for fans!",
      "second-name": "Samantha Reed",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Not very scary, but entertaining. Loved the set design."
    },
    {
      "id": 48,
      "title": "Evil Dead Rise",
      "poster": "evil-dead-rise.jpeg",
      "year": "2023",
      "genre": "horror, gore",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Two estranged sisters reunite, only to have their reunion cut short by the rise of flesh-possessing demons in a cramped urban apartment.",
      "our-review": "Absolutely brutal and unrelenting. A worthy and fresh entry in the Evil Dead series, with a new setting and nonstop terror.",
      "cast": "Alyssa Sutherland, Lily Sullivan, Nell Fisher",
      "first-name": "Brandon Lee",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Terrifying and relentless. This one sticks with you.",
      "second-name": "Ruby Zhang",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "A gorefest with heart. Loved the new direction and creepy visuals."
    },
    {
      "id": 49,
      "title": "Skinamarink",
      "poster": "skinamarink.jpeg",
      "year": "2022",
      "genre": "experimental horror",
      "rating": "⭐️⭐️⭐️",
      "summary": "Two children wake up to find their father missing and windows and doors in their home disappearing, leading to a surreal and disorienting nightmare.",
      "our-review": "An arthouse horror experience unlike any other. Slow, eerie, and atmospheric—it’s more about the feeling than the plot. Not for everyone.",
      "cast": "Lucas Paul, Dali Rose Tetreault",
      "first-name": "Ivy Mercer",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Terrifying in a subtle, lingering way. Felt like a fever dream.",
      "second-name": "Theo Barnes",
      "second-rating": "⭐️⭐️",
      "second-review": "I just didn’t get it. Too slow and abstract for me, but I appreciate the risk it took."
    },
    {
      "id": 50,
      "title": "Still: A Michael J. Fox Movie",
      "poster": "still-a-michael-j-fox-movie.jpeg",
      "year": "2023",
      "genre": "documentary, biography",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "An intimate documentary that chronicles Michael J. Fox's rise to fame and his ongoing battle with Parkinson's disease, blending archival footage with candid interviews.",
      "our-review": "A heartfelt and inspiring portrait of resilience, offering a deep dive into Fox's life with sincerity and humor.",
      "cast": "Michael J. Fox",
      "first-name": "Emily Rose",
      "first-rating": "⭐️⭐️⭐️⭐️⭐️",
      "first-review": "A moving and honest depiction of Fox's journey. Truly inspiring.",
      "second-name": "Oliver Harris",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "Well-crafted and engaging. A must-watch for fans and newcomers alike."
    },
    {
      "id": 51,
      "title": "The Deepest Breath",
      "poster": "the-deepest-breath.jpeg",
      "year": "2023",
      "genre": "documentary, sports",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A gripping exploration of the world of free diving, focusing on the bond between champion Alessia Zecchini and safety diver Stephen Keenan.",
      "our-review": "Visually stunning and emotionally resonant, it captures the allure and dangers of extreme sports.",
      "cast": "Alessia Zecchini, Stephen Keenan",
      "first-name": "Janelle Park",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "An exhilarating and poignant documentary that left me breathless.",
      "second-name": "Damien West",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Beautiful cinematography, though the pacing felt slow at times."
    },
    {
      "id": 52,
      "title": "Navalny",
      "poster": "navalny.jpeg",
      "year": "2022",
      "genre": "documentary, political",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A revealing look into Russian opposition leader Alexei Navalny's life, his poisoning, and his fight against corruption.",
      "our-review": "A compelling and timely documentary that plays out like a political thriller.",
      "cast": "Alexei Navalny",
      "first-name": "Tara Singh",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Gripping and informative. A stark reminder of the risks faced by dissenters.",
      "second-name": "Miles Carter",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Important subject matter, though some parts felt repetitive."
    },
    {
      "id": 53,
      "title": "American Symphony",
      "poster": "american-symphony.jpeg",
      "year": "2023",
      "genre": "documentary, music",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Follows musician Jon Batiste as he composes a symphony while his partner, writer Suleika Jaouad, undergoes cancer treatment.",
      "our-review": "A touching narrative that intertwines art, love, and resilience.",
      "cast": "Jon Batiste, Suleika Jaouad",
      "first-name": "Jess Rowe",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Emotionally powerful and beautifully scored.",
      "second-name": "Omar Delgado",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Heartfelt, though it could have delved deeper into the creative process."
    },
    {
      "id": 54,
      "title": "The Pigeon Tunnel",
      "poster": "the-pigeon-tunnel.jpeg",
      "year": "2023",
      "genre": "documentary, biography",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "An exploration of the life and work of author John le Carré, featuring his final interview and archival footage.",
      "our-review": "A fascinating insight into the mind of a literary giant, blending personal anecdotes with historical context.",
      "cast": "John le Carré",
      "first-name": "Kelsey Tran",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Engaging and enlightening. A treat for fans of espionage literature.",
      "second-name": "David Moon",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Informative, though the pacing was uneven at times."
    },
    {
      "id": 55,
      "title": "Bobi Wine: The People's President",
      "poster": "bobi-wine-the-peoples-president.jpeg",
      "year": "2023",
      "genre": "documentary, political",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Chronicles Ugandan musician Bobi Wine's transformation into a political leader challenging the country's long-standing regime.",
      "our-review": "An inspiring tale of courage and activism, shedding light on Uganda's political landscape.",
      "cast": "Bobi Wine",
      "first-name": "Carlos Vega",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Powerful and moving. A testament to the power of music and determination.",
      "second-name": "Samantha Reed",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Eye-opening, though some context on Uganda's history would have been helpful."
    },
    {
      "id": 56,
      "title": "Beyond Utopia",
      "poster": "beyond-utopia.jpeg",
      "year": "2023",
      "genre": "documentary, human rights",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Follows several families as they attempt to escape oppression in North Korea, revealing a world most have never seen.",
      "our-review": "A harrowing and eye-opening documentary that highlights the human cost of authoritarian regimes.",
      "cast": "Various",
      "first-name": "Brandon Lee",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Heart-wrenching and powerful. A must-watch.",
      "second-name": "Ruby Zhang",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Informative, though the narrative could have been more cohesive."
    },
    {
      "id": 57,
      "title": "Fire of Love",
      "poster": "fire-of-love.jpeg",
      "year": "2022",
      "genre": "documentary, romance",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "Tells the story of volcanologists Katia and Maurice Krafft, who died in a volcanic explosion doing the very thing that brought them together.",
      "our-review": "A visually stunning and poetic tribute to a couple united by their passion for volcanoes.",
      "cast": "Katia Krafft, Maurice Krafft",
      "first-name": "Ivy Mercer",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "Beautifully crafted and deeply moving.",
      "second-name": "Theo Barnes",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Captivating visuals, though it left me wanting more personal insights."
    },
    {
      "id": 58,
      "title": "The Mission",
      "poster": "the-mission.jpeg",
      "year": "2023",
      "genre": "documentary, biography",
      "rating": "⭐️⭐️⭐️",
      "summary": "Explores the life and tragic death of missionary John Allen Chau, who was killed while attempting to contact an isolated tribe.",
      "our-review": "A thought-provoking examination of faith, ambition, and the consequences of cultural intrusion.",
      "cast": "John Allen Chau",
      "first-name": "Emily Rose",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "A sobering look at the complexities of missionary work.",
      "second-name": "Oliver Harris",
      "second-rating": "⭐️⭐️",
      "second-review": "Raises important questions, but felt lacking in depth."
    },
    {
      "id": 59,
      "title": "Desperate Souls, Dark City and the Legend of Midnight Cowboy",
      "poster": "desperate-souls-dark-city-and-the-legend-of-midnight-cowboy.jpeg",
      "year": "2023",
      "genre": "documentary, film history",
      "rating": "⭐️⭐️⭐️",
      "summary": "A behind-the-scenes look at the making of 'Midnight Cowboy' and its cultural impact during a tumultuous era.",
      "our-review": "An insightful exploration of a cinematic classic and the era it emerged from.",
      "cast": "Jon Voight, Bob Balaban, Brian De Palma",
      "first-name": "Kelsey Tran",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "Informative for film enthusiasts, though it meanders at times.",
      "second-name": "David Moon",
      "second-rating": "⭐️⭐️",
      "second-review": "Interesting subject, but the presentation felt disjointed."
    },
    {
      "id": 60,
      "title": "Dune: Part Two",
      "poster": "dune-part-two.jpeg",
      "year": "2024",
      "genre": "science fiction, adventure",
      "rating": "⭐️⭐️⭐️⭐️⭐️",
      "summary": "The continuation of the epic saga of Paul Atreides, as he seeks to avenge his family and take control of the desert planet, Arrakis, in the fight for the most valuable substance in the universe.",
      "our-review": "A visually stunning and compelling continuation of the Dune saga, delivering on both the grand scale of the story and its deeply philosophical themes.",
      "cast": "Timothée Chalamet, Zendaya, Rebecca Ferguson, Oscar Isaac",
      "first-name": "Janelle Park",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "An ambitious follow-up that improves on the first film with grander action sequences and deeper character exploration.",
      "second-name": "Oliver Harris",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "Masterful in its world-building and visual spectacle, though the pacing can feel slow at times."
    },
    {
      "id": 61,
      "title": "Rebel Moon",
      "poster": "rebel-moon.webp",
      "year": "2023",
      "genre": "science fiction, action",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A young woman from a peaceful colony on the edge of the galaxy is tasked with finding warriors to help save her people from the oppressive forces threatening them.",
      "our-review": "A visually striking space opera that blends elements of classic sci-fi with modern storytelling. The film's expansive world and thrilling action sequences stand out.",
      "cast": "Sofia Boutella, Charlie Hunnam, Djimon Hounsou",
      "first-name": "Carlos Vega",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A fantastic mix of action and deep lore. The scale and stakes are high, though some of the character development could have been better.",
      "second-name": "Ivy Mercer",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Epic in scope and visually breathtaking, but the story struggles with pacing issues."
    },
    {
      "id": 62,
      "title": "The Marvels",
      "poster": "the-marvels.jpeg",
      "year": "2023",
      "genre": "science fiction, action, superhero",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "The MCU brings together Captain Marvel, Monica Rambeau, and Kamala Khan (Ms. Marvel) as they must team up to save the universe from a new, unknown threat.",
      "our-review": "A fast-paced and fun superhero adventure that brings fresh energy to the Marvel Cinematic Universe, with a great dynamic between its three leads.",
      "cast": "Brie Larson, Teyonah Parris, Iman Vellani, Park Seo-jun",
      "first-name": "Theo Barnes",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "The chemistry between the leads makes the movie enjoyable, and the stakes are thrilling. However, some plot points feel rushed.",
      "second-name": "Emily Rose",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "Entertaining but at times lacks depth. It's fun but feels like a setup for future films."
    },
    {
      "id": 63,
      "title": "The Creator",
      "poster": "the-creator.jpeg",
      "year": "2023",
      "genre": "science fiction, thriller",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "In a futuristic world where AI has become sentient, a former soldier is tasked with hunting down the creator of the AI technology and preventing its control of the planet.",
      "our-review": "A gripping sci-fi thriller with stunning visuals and deep ethical dilemmas surrounding AI and humanity's future.",
      "cast": "John David Washington, Gemma Chan, Allison Janney",
      "first-name": "Ruby Zhang",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A visually mesmerizing and thought-provoking film that raises important questions about technology and its impact on society.",
      "second-name": "Brandon Lee",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "The story is intriguing, but the pacing could have been tighter, and some of the plot twists were predictable."
    },
    {
      "id": 64,
      "title": "Relic",
      "poster": "relic.jpeg",
      "year": "2023",
      "genre": "science fiction, horror",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A mother and daughter search for the truth behind strange occurrences after their family home is invaded by an otherworldly presence.",
      "our-review": "A chilling and atmospheric science fiction horror film that blends mystery with psychological tension.",
      "cast": "Emily Mortimer, Robyn Nevin, Bella Heathcote",
      "first-name": "Samantha Reed",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A terrifyingly well-executed story with deep emotional layers. The horror elements are both subtle and effective.",
      "second-name": "Kelsey Tran",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "The suspense is palpable, though some plot points felt underdeveloped."
    },
    {
      "id": 65,
      "title": "65",
      "poster": "65.jpeg",
      "year": "2023",
      "genre": "science fiction, adventure",
      "rating": "⭐️⭐️⭐️",
      "summary": "After crash-landing on Earth 65 million years ago, an astronaut must navigate the dangerous prehistoric landscape to survive.",
      "our-review": "An entertaining sci-fi adventure with solid action sequences but doesn't offer much depth in character development.",
      "cast": "Adam Driver, Ariana Greenblatt",
      "first-name": "David Moon",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "A thrilling ride, but it's more about spectacle than character exploration.",
      "second-name": "Theo Barnes",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "The premise is exciting, though the film struggles with predictability."
    },
    {
      "id": 66,
      "title": "Infinite",
      "poster": "infinite.jpeg",
      "year": "2023",
      "genre": "science fiction, action",
      "rating": "⭐️⭐️⭐️",
      "summary": "A man discovers that his hallucinations are actually glimpses of past lives, and he must unlock the mysteries of his existence to save the future.",
      "our-review": "A fast-paced action film with a unique premise, though the execution falls short of fully exploring its fascinating concept.",
      "cast": "Mark Wahlberg, Chiwetel Ejiofor, Sophie Cookson",
      "first-name": "Emily Rose",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "Fun to watch but doesn't quite hit the emotional or intellectual mark that it aims for.",
      "second-name": "Carlos Vega",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "The concept is intriguing, but the storytelling feels shallow."
    },
    {
      "id": 67,
      "title": "Voyagers",
      "poster": "voyagers.webp",
      "year": "2023",
      "genre": "science fiction, drama",
      "rating": "⭐️⭐️⭐️",
      "summary": "A group of young astronauts on a multi-generational voyage to a distant planet begins to break down due to a lack of leadership and mounting tensions among the crew.",
      "our-review": "A thought-provoking, though sometimes overdramatic, exploration of human nature under extreme circumstances.",
      "cast": "Tye Sheridan, Lily-Rose Depp, Colin Farrell",
      "first-name": "Oliver Harris",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "The film's exploration of human psychology in space is intriguing, but some of the character motivations are unclear.",
      "second-name": "Janelle Park",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "A solid premise, but it felt like it could have explored its themes more deeply."
    },
    {
      "id": 68,
      "title": "After Yang",
      "poster": "after-yang.jpeg",
      "year": "2023",
      "genre": "science fiction, drama",
      "rating": "⭐️⭐️⭐️⭐️",
      "summary": "A father struggles to understand the loss of his family's robot after it malfunctions, leading him to reflect on life and relationships in a futuristic world.",
      "our-review": "A quiet, introspective film that offers deep insights into life, loss, and the role of technology in our emotional lives.",
      "cast": "Colin Farrell, Jodie Turner-Smith, Justin H. Min",
      "first-name": "Ruby Zhang",
      "first-rating": "⭐️⭐️⭐️⭐️",
      "first-review": "A moving and philosophical exploration of what it means to be human in a technologically advanced world.",
      "second-name": "Brandon Lee",
      "second-rating": "⭐️⭐️⭐️⭐️",
      "second-review": "Quiet, thoughtful, and poignant – this film offers much to reflect on regarding human relationships and technology."
    },
    {
      "id": 69,
      "title": "Archive",
      "poster": "archive.jpeg",
      "year": "2023",
      "genre": "science fiction, thriller",
      "rating": "⭐️⭐️⭐️",
      "summary": "A scientist working on AI and robotic technology attempts to bring back his dead wife by creating a lifelike robot replica, leading to unexpected consequences.",
      "our-review": "A solid sci-fi thriller with a focus on grief and the ethical dilemmas of technology, though it sometimes relies too heavily on familiar tropes.",
      "cast": "Theo James, Stacy Martin, Rhys Ifans",
      "first-name": "Samantha Reed",
      "first-rating": "⭐️⭐️⭐️",
      "first-review": "An interesting exploration of grief, though the narrative could have been more original.",
      "second-name": "Ivy Mercer",
      "second-rating": "⭐️⭐️⭐️",
      "second-review": "A fascinating premise, but it doesn't offer many surprises in its execution."
    }
    
  ]
}
