{
    "details":[
        {
            "id":1,
            "title": "sinners",
            "poster": "img/sinners.png",
            "year": "2025",
            "genre": "horror",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "Sinners is a Southern Gothic horror-musical directed by Ryan Coogler. Set in 1930s Mississippi, it follows twin brothers who open a juke joint that becomes a battleground between a Black community and a group of supernatural vampires. Blending music, horror, and social commentary, the film explores themes of race, identity, and cultural power through a haunting and visually rich story.​",
            "our-review": "Sinners has captured the attention of viewers with its dark, gripping storyline that explores moral ambiguity and the complexity of human desires. The show's intricate character development, particularly in its portrayal of conflicted protagonists, has been widely praised for its depth and realism. The suspenseful narrative keeps audiences on edge, with unexpected twists that heighten the emotional stakes. However, some viewers have noted that while the show's atmosphere is compelling, certain plot points can feel overly convoluted. Overall, Sinners offers a captivating blend of psychological drama and thriller elements, making it a strong choice for fans of intense, thought-provoking television.",
            "cast": "Michael B. Jordan as Elijah Smoke Moore / Elias Stack, Moore Miles Caton as Sammie Moore, Jack O'Connell as Remmick, Hailee Steinfeld as Mary, Wunmi Mosaku as Annie Delroy Lindo as Delta Slim",
            "first-name": "Alex Harper",
            "first-rating":"⭐️⭐️⭐️⭐️",
            "first-review": "Sinners is a unique mix of horror and musical, set in 1930s Mississippi. The film's eerie atmosphere, combined with a blues-heavy soundtrack, creates a haunting experience. Michael B. Jordan shines in his dual role, and Miles Caton’s performance is a standout. While the plot can be a bit confusing, the film’s bold commentary on race and identity, along with its supernatural twists, makes it a memorable watch.",
            "second-name":"Hailey Smith",
            "second-rating":"⭐️⭐️⭐️",
            "second-review":"Sinners offers an interesting mix of horror and musical elements, set against a Southern Gothic backdrop. The atmosphere is captivating, and the music adds depth to the story. Michael B. Jordan does a solid job, but the plot feels a bit overcomplicated at times. While it explores important themes of race and identity, it doesn’t fully deliver on its potential. Still, it’s a unique film worth watching if you’re into bold, genre-bending stories."
           
        },
        {
            "id": 2,
            "title": "Spider-Man: No Way Home",
            "poster": "img/spiderman-noway-home.png",
            "year": "2021",
            "genre": "action, superhero",
            "rating": "⭐️⭐️⭐️⭐️½",
            "summary": "Spider-Man: No Way Home, directed by Jon Watts, brings together three generations of Spider-Men in a multiverse-shattering event. After Peter Parker’s identity is exposed, he turns to Doctor Strange for help, unleashing chaos as villains from other realities arrive in his world. A thrilling, emotional ride blending nostalgia, action, and sacrifice.",
            "our-review": "No Way Home is both a celebration of Spider-Man’s cinematic legacy and a heartfelt story about identity and consequence. Tom Holland delivers his most mature performance, while the returning villains and Spider-Men make for unforgettable fan moments. Though the plot can feel packed, the emotional payoff is immense.",
            "cast": "Tom Holland as Peter Parker, Zendaya as MJ, Benedict Cumberbatch as Doctor Strange, Willem Dafoe as Green Goblin, Tobey Maguire as Peter Parker (Earth-96283), Andrew Garfield as Peter Parker (Earth-120703)",
            "first-name": "Caleb Norris",
            "first-rating": "⭐️⭐️⭐️⭐️⭐️",
            "first-review": "Absolutely incredible! Seeing Tobey, Andrew, and Tom together brought tears to my eyes. The emotional beats hit hard, and the action was top-tier.",
            "second-name": "Emily Zhao",
            "second-rating": "⭐️⭐️⭐️⭐️",
            "second-review": "The nostalgia is powerful, and it’s one of the most ambitious superhero films yet. Some plot holes, but who cares when it’s this much fun?"
        },
        {
            "id": 3,
            "title": "Dune: Part Two",
            "poster": "img/dune.png",
            "year": "2024",
            "genre": "sci-fi, adventure",
            "rating": "⭐️⭐️⭐️⭐️⭐️",
            "summary": "Directed by Denis Villeneuve, Dune: Part Two continues Paul Atreides' journey as he unites with the Fremen to seek vengeance and fulfill his destiny on the desert planet Arrakis. With war looming, alliances are forged, and a messianic prophecy begins to unfold.",
            "our-review": "Epic in scope and stunning in execution, Dune: Part Two is a masterclass in world-building and storytelling. Timothée Chalamet delivers a commanding performance, while the film's visuals and score are utterly mesmerizing. A cinematic triumph that honors the source material while pushing sci-fi boundaries.",
            "cast": "Timothée Chalamet as Paul Atreides, Zendaya as Chani, Rebecca Ferguson, Josh Brolin, Javier Bardem, Florence Pugh, Austin Butler",
            "first-name": "Kevin Tran",
            "first-rating": "⭐️⭐️⭐️⭐️⭐️",
            "first-review": "Absolutely mind-blowing. Denis Villeneuve has created something timeless. The visuals, the themes, the tension—it’s all perfectly balanced.",
            "second-name": "Sofia Moreno",
            "second-rating": "⭐️⭐️⭐️⭐️½",
            "second-review": "More action-packed than the first and emotionally richer. A bit long, but well worth it for sci-fi fans."
          },
          {
            "id": 4,
            "title": "Barbie",
            "poster": "img/barbie.png",
            "year": "2023",
            "genre": "comedy, fantasy",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "Directed by Greta Gerwig, Barbie is a satirical yet heartfelt take on identity and womanhood. When Barbie leaves her perfect pink world to explore the real one, she confronts societal norms and rediscovers what it truly means to be herself.",
            "our-review": "Barbie is unexpectedly clever, layered with witty humor and emotional insight. Margot Robbie and Ryan Gosling shine in a story that balances fun and feminism without losing its charm. A colorful, bold cinematic statement.",
            "cast": "Margot Robbie as Barbie, Ryan Gosling as Ken, America Ferrera, Kate McKinnon, Simu Liu, Will Ferrell",
            "first-name": "Jenna Price",
            "first-rating": "⭐️⭐️⭐️⭐️½",
            "first-review": "Greta Gerwig made Barbie funny, thoughtful, and empowering. Totally not what I expected—in a good way.",
            "second-name": "Elliot Hughes",
            "second-rating": "⭐️⭐️⭐️⭐️",
            "second-review": "Bright and hilarious. Some jokes are a little on the nose, but it’s refreshing to see something so unapologetically different."
          },
          {
            "id": 5,
            "title": "Oppenheimer",
            "poster": "img/oppenheimer.png",
            "year": "2023",
            "genre": "drama, historical, thriller",
            "rating": "⭐️⭐️⭐️⭐️½",
            "summary": "Christopher Nolan’s Oppenheimer is a biographical thriller chronicling the life of J. Robert Oppenheimer and the development of the atomic bomb. Intense, cerebral, and gripping, it’s a film about genius, guilt, and legacy.",
            "our-review": "Cillian Murphy delivers a haunting performance in a film that’s as intellectually dense as it is emotionally raw. Nolan’s non-linear storytelling works well here, though it may challenge some viewers. A thought-provoking epic.",
            "cast": "Cillian Murphy as J. Robert Oppenheimer, Emily Blunt, Robert Downey Jr., Matt Damon, Florence Pugh, Rami Malek",
            "first-name": "Luis Chang",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "Heavy and intense. Not your typical Nolan action film, but one of his most mature and important works.",
            "second-name": "Naomi Sinclair",
            "second-rating": "⭐️⭐️⭐️⭐️½",
            "second-review": "Cillian Murphy is phenomenal. The weight of history just crushes you in the best way. Demands your full attention."
          },
          {
            "id": 6,
            "title": "Avatar: The Way of Water",
            "poster": "img/avatar-2.png",
            "year": "2022",
            "genre": "sci-fi, adventure",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "James Cameron returns with a breathtaking sequel that explores the oceanic world of Pandora. As Jake Sully and Neytiri face new threats, they must protect their family and embrace the rhythms of the sea.",
            "our-review": "Visually stunning and emotionally rich, The Way of Water expands Avatar’s universe with awe-inspiring underwater sequences. While the plot isn’t groundbreaking, the immersive world-building and heartfelt themes more than compensate.",
            "cast": "Sam Worthington, Zoe Saldaña, Sigourney Weaver, Kate Winslet, Stephen Lang",
            "first-name": "Amir Wallace",
            "first-rating": "⭐️⭐️⭐️⭐️½",
            "first-review": "One of the most beautiful films I’ve ever seen. The story is simple but powerful. Cameron still has it.",
            "second-name": "Rachel Lim",
            "second-rating": "⭐️⭐️⭐️⭐️",
            "second-review": "It’s long but magical. The underwater visuals are breathtaking. I felt like I was on Pandora."
          },
          {
            "id": 7,
            "title": "John Wick: Chapter 4",
            "poster": "img/john-wick-4.png",
            "year": "2023",
            "genre": "action, thriller",
            "rating": "⭐️⭐️⭐️⭐️½",
            "summary": "In Chapter 4, John Wick faces his most dangerous foes yet as he seeks freedom from the High Table. With alliances shifting and battles raging across continents, the stakes have never been higher.",
            "our-review": "Stylish, relentless, and beautifully choreographed, John Wick 4 pushes action cinema to its limits. Keanu Reeves is as stoic and badass as ever, and the film’s global scale keeps it fresh without losing its core intensity.",
            "cast": "Keanu Reeves, Donnie Yen, Hiroyuki Sanada, Bill Skarsgård, Laurence Fishburne",
            "first-name": "Tyler Brooks",
            "first-rating": "⭐️⭐️⭐️⭐️⭐️",
            "first-review": "The fight scenes are insane. Best action movie I’ve seen in years. Keanu just doesn’t miss.",
            "second-name": "Lana Ortiz",
            "second-rating": "⭐️⭐️⭐️⭐️",
            "second-review": "A wild ride from start to finish. Some parts feel repetitive, but the spectacle is unmatched."
          },
          {
            "id": 8,
            "title": "The Batman",
            "poster": "img/the-batman.png",
            "year": "2022",
            "genre": "crime, superhero, noir",
            "rating": "⭐️⭐️⭐️⭐️",
            "summary": "Directed by Matt Reeves, The Batman reimagines the caped crusader in a gritty detective noir. Battling corruption and facing the enigmatic Riddler, Bruce Wayne delves deeper into Gotham’s shadows than ever before.",
            "our-review": "Dark, atmospheric, and cerebral, The Batman is a gripping take on the world’s greatest detective. Robert Pattinson brings a brooding intensity, and the film’s tone feels closer to a mystery thriller than traditional superhero fare.",
            "cast": "Robert Pattinson as Bruce Wayne, Zoë Kravitz as Selina Kyle, Paul Dano as The Riddler, Jeffrey Wright, Colin Farrell",
            "first-name": "Marcus Dean",
            "first-rating": "⭐️⭐️⭐️⭐️",
            "first-review": "Moody and immersive. Feels like a crime novel brought to life. Pattinson really surprised me.",
            "second-name": "Elena Rivera",
            "second-rating": "⭐️⭐️⭐️⭐️",
            "second-review": "Loved the noir vibe and mystery. Some pacing issues, but visually and tonally fantastic."
          },
          {
            "id": 9,
            "title": "Everything Everywhere All At Once",
            "poster": "img/eeaao.png",
            "year": "2022",
            "genre": "sci-fi, drama, comedy",
            "rating": "⭐️⭐️⭐️⭐️⭐️",
            "summary": "Directed by the Daniels, this genre-bending film follows Evelyn, a laundromat owner who is pulled into a multiverse adventure where she must tap into alternate lives to save existence—and her family.",
            "our-review": "Inventive, chaotic, and deeply human, this film is a rare blend of absurdity and emotion. Michelle Yeoh gives a career-best performance, and the movie’s wild creativity is balanced by poignant themes of love and acceptance.",
            "cast": "Michelle Yeoh, Ke Huy Quan, Stephanie Hsu, Jamie Lee Curtis, James Hong",
            "first-name": "Riley Chen",
            "first-rating": "⭐️⭐️⭐️⭐️⭐️",
            "first-review": "Mind-blowing and touching. I laughed, cried, and sat in awe. Easily one of the best movies I’ve ever seen.",
            "second-name": "Darius King",
            "second-rating": "⭐️⭐️⭐️⭐️½",
            "second-review": "Completely unique. So much packed into one movie, but it works. Weird in the best way possible."
          }

          

          

    
    ]  

    
}